{"pages":[{"text":"I personally love the concept of hacking around with friends and making new things by tinkering with existing stuff. It is essential for engineers to be able to break things apart and find new ways of putting them together. That's creativity to me in short. \"Maker Culture\" is a term associated with a movement taking place all over the world that recognises the fact that Innovation requires an ecosystem of nurture and collaboration. One of the things that I had promised my volunteers at Maker Party Kochi Learning stations was to set up such an environment at CUSAT. An excellent opportunity soon surfaced where Mr Sijo Kuruvilla, founding CEO of Startup Village, Kochi expressed his willingness to guide myself and my friend Meher in setting up an open Learning space in CUSAT. The idea was to enable the participants to become independent learners by taking part in MOOCs and then go on to collaborate and build on new ideas, a creative space for learning and sharing. The activities of the space began with an inauguration by Sijo where he discussed on the importance of online learning and 21st century skills. In the following days, the \"tinkerers\" interacted with Entrepreneurs from Kochi and Bangalore. Jibin Jose, Founder Flip Technologies talked on How to get selected and get exposure from programs like the SV Square, NASA Mars Rover Challenge and Flat6Labs, the accelerator program his company has been selected for. He advised the students to apply for all opportunities and learn from the mistakes made in the application. He also added that asking for feedback is an essential skill to be picked up quickly. The students took part in a couple of curated MOOCs on Web Development and Mobile App development. We even assembled together a 3D printer thanks to DIYHacking's Aravind Sanjeev. The students got an opportunity to get a hands on feel for rapid hardware prototyping. (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"//connect.facebook.net/en_US/sdk.js#xfbml=1&version=v2.3\"; fjs.parentNode.insertBefore(js, fjs);}(document, 'script', 'facebook-jssdk')); Posted by TinkerHub on Sunday, March 8, 2015 (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"//connect.facebook.net/en_US/sdk.js#xfbml=1&version=v2.3\"; fjs.parentNode.insertBefore(js, fjs);}(document, 'script', 'facebook-jssdk')); Posted by TinkerHub on Sunday, March 8, 2015 We formed a couple of clubs within the community, a Reader's club and an Algorithms club. A particular discussion on various means of consuming content apart from books lead us into talking about the effectiveness of alternative media like audio-books, blogs, and applications like FlipBoard. (function(d, s, id) { var js, fjs = d.getElementsByTagName(s)[0]; if (d.getElementById(id)) return; js = d.createElement(s); js.id = id; js.src = \"//connect.facebook.net/en_US/sdk.js#xfbml=1&version=v2.3\"; fjs.parentNode.insertBefore(js, fjs);}(document, 'script', 'facebook-jssdk')); Posted by TinkerHub on Wednesday, March 18, 2015 More talks on Entrepreneurship, skill development and technology followed with the likes of Akash Mathew, CEO of CIED Technologies, Safwan Eroth, CEO of Tridz, a software development firm based in Bangalore and Midhun Sankar, CEO of Verbitio as speakers. With the end of the academic year and onset of exams, we closed doors with a promise to reopen a much bigger learning experience in the coming months.","tags":"TinkerHub","loc":"/tinkerhub-cusats-own-maker-space.html","title":"TinkerHub - CUSAT's own Maker Space"},{"text":"The Internet is the in thing. Everyone knows that. But very few know and much less appreciate the fact that anyone can be a content creator rather than just being a content consumer on the web. This single fact makes the web such an interesting concept. You do not need to find a publisher to bring out your words to the mass. You no longer need to be a journalist to express your view on the world happenings. With the power of the open web, you have the freedom to express yourselves freely, without any restrictions. Note the use of the term \"Open Web\". That is because, unfortunately, there do exist geographies where even this freedom is curtailed. But on a more positive note, billions of people are now empowered to consume and create content on their interests with the help of the web. The sad part is that only a handful of these billions of people are aware of the real power of the web, which is content creation. Maker Party, an initiative of the Mozilla Foundation aims at solving this very problem. To quote from its website : Our goal is to help people move beyond simply consuming the web to understanding and creating it, so it remains open, accessible and ours. With the exact same goal, Mozilla Kerala set out to host its own version of Maker Party at Cochin University of Science and Technology (CUSAT) with the help of Centre for Innovation, Technology Transfer and Industrial Collaboration(CITTIC) (phew! what is with institutions and abbreviations? :P ) I took up the job of looking after the \"Learning Stations\", which are the primary attractions of any Maker Party. These are essentially small tables with volunteers explaining various technologies to a small group of learners using interactive media and even hackable demos. We took a very out of the ordinary approach of bringing in volunteers who didn't have expertise in the various technology topics and trained them over the course of a week on the basics of web technologies and hardware prototyping. These volunteers armed with the newly gained knowledge then passed it on to the thousands of the participants who visited the respective stations. In an essence, the experience was a \"Learning by Teaching\" one for the volunteers. This model served brilliantly since the aim of these stations is not to teach an entire technology in a single sitting, but to make the learners aware of the basics of technology and give pointers on how it can be learnt. In fact, I was very worried for my volunteers thinking, what if someone who already knows about the topic comes in? Would the volunteers be able to answer their advanced queries? I had already made it clear that any advanced queries were to be directed to more experienced Mozillians, but still had concerns. I was brought to peace during the Maker Party, when I heard from Anisha, one of the volunteers at the Raspberry Pi learning station about how one of the visitors, who was experienced about the $25 single board computer even helped and corrected her while she was explaining on the topic. We had a lot of fun organising Maker Party, it was a festival of learning, teaching and networking. Maker Party would not have been possible without my dear friends Abid and Meher along with the 100+ enthusiastic volunteers, mostly juniors from CUSAT. Most importantly it has helped me validate the \"Learning by Teaching\" model. If you missed out on the event, this video would give you a sneak peek into the happenings.","tags":"mozilla","loc":"/maker-party-kochi.html","title":"Maker Party Kochi"}]}